GHB2/src/InformationRegisters/гхб_ЗакреплениеСотрудниковЗаПомещениями/гхб_ЗакреплениеСотрудниковЗаПомещениями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ЗакреплениеСотрудниковЗаПомещениями</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>РежимРаботы</name>
    <type>
      <types>CatalogRef.гхб_РежимРаботыВПомещении</types>
    </type>
  </attributes>
  <attributes>
    <name>Плавающее</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_ЗакреплениеСотрудниковЗаПомещениями/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВернутьАктуальныхСотрудниковДляПомещения(_Помещение) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_ЗакреплениеСотрудниковЗаПомещениямиСрезПоследних.Сотрудник КАК Сотрудник,
	               |	гхб_ЗакреплениеСотрудниковЗаПомещениямиСрезПоследних.РежимРаботы КАК РежимРаботы,
	               |	гхб_ЗакреплениеСотрудниковЗаПомещениямиСрезПоследних.Плавающее КАК Плавающее
	               |ИЗ
	               |	РегистрСведений.гхб_ЗакреплениеСотрудниковЗаПомещениями.СрезПоследних(, Помещение = &Помещение) КАК гхб_ЗакреплениеСотрудниковЗаПомещениямиСрезПоследних
	               |ГДЕ
	               |	НЕ гхб_ЗакреплениеСотрудниковЗаПомещениямиСрезПоследних.Закрыть";
	
	Запрос.УстановитьПараметр("Помещение", _Помещение);
	Выборка = Запрос.Выполнить().Выбрать();
	
	_Массив = Новый Массив();
	
	Пока Выборка.Следующий() Цикл
		_Массив.Добавить(Новый Структура("Сотрудник, РежимРаботы, Плавающее", Выборка.Сотрудник, Выборка.РежимРаботы, Выборка.Плавающее));
	КонецЦикла;
	
	Возврат _Массив;
	
КонецФункции

Функция ВернутьАктуальныеПомещенияДляСотрудника(_Сотрудник) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_ЗакреплениеСотрудниковЗаПомещениямиСрезПоследних.Помещение КАК Помещение,
	               |	гхб_ЗакреплениеСотрудниковЗаПомещениямиСрезПоследних.РежимРаботы КАК РежимРаботы,
	               |	гхб_ЗакреплениеСотрудниковЗаПомещениямиСрезПоследних.Плавающее КАК Плавающее
	               |ИЗ
	               |	РегистрСведений.гхб_ЗакреплениеСотрудниковЗаПомещениями.СрезПоследних(, Сотрудник = &Сотрудник) КАК гхб_ЗакреплениеСотрудниковЗаПомещениямиСрезПоследних
	               |ГДЕ
	               |	НЕ гхб_ЗакреплениеСотрудниковЗаПомещениямиСрезПоследних.Закрыть";
	
	Запрос.УстановитьПараметр("Сотрудник", _Сотрудник);
	Выборка = Запрос.Выполнить().Выбрать();
	
	_Массив = Новый Массив();
	
	Пока Выборка.Следующий() Цикл
		_Массив.Добавить(Новый Структура("Помещение, РежимРаботы, Плавающее", Выборка.Помещение, Выборка.РежимРаботы, Выборка.Плавающее));
	КонецЦикла;
	
	Возврат _Массив;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
